{"weightsManifest": [{"paths": ["group1-shard1of7", "group1-shard2of7", "group1-shard3of7", "group1-shard4of7", "group1-shard5of7", "group1-shard6of7", "group1-shard7of7"], "weights": [{"dtype": "float32", "name": "bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "bn/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "conv1/bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv1/bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv1/bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv1/bn/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "conv1/conv/kernel", "shape": [7, 7, 1, 64]}, {"dtype": "float32", "name": "conv2_block1_0_bn/gamma", "shape": [64]}, {"dtype": "float32", "name": "conv2_block1_0_bn/beta", "shape": [64]}, {"dtype": "float32", "name": "conv2_block1_0_bn/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "conv2_block1_0_bn/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "conv2_block1_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv2_block1_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv2_block1_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv2_block1_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv2_block1_1_conv/kernel", "shape": [1, 1, 64, 128]}, {"dtype": "float32", "name": "conv2_block1_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv2_block2_0_bn/gamma", "shape": [96]}, {"dtype": "float32", "name": "conv2_block2_0_bn/beta", "shape": [96]}, {"dtype": "float32", "name": "conv2_block2_0_bn/moving_mean", "shape": [96]}, {"dtype": "float32", "name": "conv2_block2_0_bn/moving_variance", "shape": [96]}, {"dtype": "float32", "name": "conv2_block2_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv2_block2_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv2_block2_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv2_block2_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv2_block2_1_conv/kernel", "shape": [1, 1, 96, 128]}, {"dtype": "float32", "name": "conv2_block2_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv2_block3_0_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv2_block3_0_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv2_block3_0_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv2_block3_0_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv2_block3_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv2_block3_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv2_block3_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv2_block3_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv2_block3_1_conv/kernel", "shape": [1, 1, 128, 128]}, {"dtype": "float32", "name": "conv2_block3_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv2_block4_0_bn/gamma", "shape": [160]}, {"dtype": "float32", "name": "conv2_block4_0_bn/beta", "shape": [160]}, {"dtype": "float32", "name": "conv2_block4_0_bn/moving_mean", "shape": [160]}, {"dtype": "float32", "name": "conv2_block4_0_bn/moving_variance", "shape": [160]}, {"dtype": "float32", "name": "conv2_block4_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv2_block4_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv2_block4_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv2_block4_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv2_block4_1_conv/kernel", "shape": [1, 1, 160, 128]}, {"dtype": "float32", "name": "conv2_block4_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv2_block5_0_bn/gamma", "shape": [192]}, {"dtype": "float32", "name": "conv2_block5_0_bn/beta", "shape": [192]}, {"dtype": "float32", "name": "conv2_block5_0_bn/moving_mean", "shape": [192]}, {"dtype": "float32", "name": "conv2_block5_0_bn/moving_variance", "shape": [192]}, {"dtype": "float32", "name": "conv2_block5_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv2_block5_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv2_block5_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv2_block5_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv2_block5_1_conv/kernel", "shape": [1, 1, 192, 128]}, {"dtype": "float32", "name": "conv2_block5_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv2_block6_0_bn/gamma", "shape": [224]}, {"dtype": "float32", "name": "conv2_block6_0_bn/beta", "shape": [224]}, {"dtype": "float32", "name": "conv2_block6_0_bn/moving_mean", "shape": [224]}, {"dtype": "float32", "name": "conv2_block6_0_bn/moving_variance", "shape": [224]}, {"dtype": "float32", "name": "conv2_block6_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv2_block6_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv2_block6_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv2_block6_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv2_block6_1_conv/kernel", "shape": [1, 1, 224, 128]}, {"dtype": "float32", "name": "conv2_block6_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block10_0_bn/gamma", "shape": [416]}, {"dtype": "float32", "name": "conv3_block10_0_bn/beta", "shape": [416]}, {"dtype": "float32", "name": "conv3_block10_0_bn/moving_mean", "shape": [416]}, {"dtype": "float32", "name": "conv3_block10_0_bn/moving_variance", "shape": [416]}, {"dtype": "float32", "name": "conv3_block10_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block10_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block10_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block10_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block10_1_conv/kernel", "shape": [1, 1, 416, 128]}, {"dtype": "float32", "name": "conv3_block10_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block11_0_bn/gamma", "shape": [448]}, {"dtype": "float32", "name": "conv3_block11_0_bn/beta", "shape": [448]}, {"dtype": "float32", "name": "conv3_block11_0_bn/moving_mean", "shape": [448]}, {"dtype": "float32", "name": "conv3_block11_0_bn/moving_variance", "shape": [448]}, {"dtype": "float32", "name": "conv3_block11_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block11_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block11_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block11_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block11_1_conv/kernel", "shape": [1, 1, 448, 128]}, {"dtype": "float32", "name": "conv3_block11_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block12_0_bn/gamma", "shape": [480]}, {"dtype": "float32", "name": "conv3_block12_0_bn/beta", "shape": [480]}, {"dtype": "float32", "name": "conv3_block12_0_bn/moving_mean", "shape": [480]}, {"dtype": "float32", "name": "conv3_block12_0_bn/moving_variance", "shape": [480]}, {"dtype": "float32", "name": "conv3_block12_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block12_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block12_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block12_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block12_1_conv/kernel", "shape": [1, 1, 480, 128]}, {"dtype": "float32", "name": "conv3_block12_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block1_0_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block1_0_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block1_0_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block1_0_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block1_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block1_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block1_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block1_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block1_1_conv/kernel", "shape": [1, 1, 128, 128]}, {"dtype": "float32", "name": "conv3_block1_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block2_0_bn/gamma", "shape": [160]}, {"dtype": "float32", "name": "conv3_block2_0_bn/beta", "shape": [160]}, {"dtype": "float32", "name": "conv3_block2_0_bn/moving_mean", "shape": [160]}, {"dtype": "float32", "name": "conv3_block2_0_bn/moving_variance", "shape": [160]}, {"dtype": "float32", "name": "conv3_block2_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block2_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block2_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block2_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block2_1_conv/kernel", "shape": [1, 1, 160, 128]}, {"dtype": "float32", "name": "conv3_block2_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block3_0_bn/gamma", "shape": [192]}, {"dtype": "float32", "name": "conv3_block3_0_bn/beta", "shape": [192]}, {"dtype": "float32", "name": "conv3_block3_0_bn/moving_mean", "shape": [192]}, {"dtype": "float32", "name": "conv3_block3_0_bn/moving_variance", "shape": [192]}, {"dtype": "float32", "name": "conv3_block3_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block3_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block3_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block3_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block3_1_conv/kernel", "shape": [1, 1, 192, 128]}, {"dtype": "float32", "name": "conv3_block3_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block4_0_bn/gamma", "shape": [224]}, {"dtype": "float32", "name": "conv3_block4_0_bn/beta", "shape": [224]}, {"dtype": "float32", "name": "conv3_block4_0_bn/moving_mean", "shape": [224]}, {"dtype": "float32", "name": "conv3_block4_0_bn/moving_variance", "shape": [224]}, {"dtype": "float32", "name": "conv3_block4_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block4_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block4_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block4_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block4_1_conv/kernel", "shape": [1, 1, 224, 128]}, {"dtype": "float32", "name": "conv3_block4_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block5_0_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv3_block5_0_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv3_block5_0_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv3_block5_0_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv3_block5_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block5_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block5_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block5_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block5_1_conv/kernel", "shape": [1, 1, 256, 128]}, {"dtype": "float32", "name": "conv3_block5_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block6_0_bn/gamma", "shape": [288]}, {"dtype": "float32", "name": "conv3_block6_0_bn/beta", "shape": [288]}, {"dtype": "float32", "name": "conv3_block6_0_bn/moving_mean", "shape": [288]}, {"dtype": "float32", "name": "conv3_block6_0_bn/moving_variance", "shape": [288]}, {"dtype": "float32", "name": "conv3_block6_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block6_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block6_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block6_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block6_1_conv/kernel", "shape": [1, 1, 288, 128]}, {"dtype": "float32", "name": "conv3_block6_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block7_0_bn/gamma", "shape": [320]}, {"dtype": "float32", "name": "conv3_block7_0_bn/beta", "shape": [320]}, {"dtype": "float32", "name": "conv3_block7_0_bn/moving_mean", "shape": [320]}, {"dtype": "float32", "name": "conv3_block7_0_bn/moving_variance", "shape": [320]}, {"dtype": "float32", "name": "conv3_block7_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block7_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block7_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block7_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block7_1_conv/kernel", "shape": [1, 1, 320, 128]}, {"dtype": "float32", "name": "conv3_block7_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block8_0_bn/gamma", "shape": [352]}, {"dtype": "float32", "name": "conv3_block8_0_bn/beta", "shape": [352]}, {"dtype": "float32", "name": "conv3_block8_0_bn/moving_mean", "shape": [352]}, {"dtype": "float32", "name": "conv3_block8_0_bn/moving_variance", "shape": [352]}, {"dtype": "float32", "name": "conv3_block8_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block8_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block8_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block8_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block8_1_conv/kernel", "shape": [1, 1, 352, 128]}, {"dtype": "float32", "name": "conv3_block8_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv3_block9_0_bn/gamma", "shape": [384]}, {"dtype": "float32", "name": "conv3_block9_0_bn/beta", "shape": [384]}, {"dtype": "float32", "name": "conv3_block9_0_bn/moving_mean", "shape": [384]}, {"dtype": "float32", "name": "conv3_block9_0_bn/moving_variance", "shape": [384]}, {"dtype": "float32", "name": "conv3_block9_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv3_block9_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv3_block9_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv3_block9_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv3_block9_1_conv/kernel", "shape": [1, 1, 384, 128]}, {"dtype": "float32", "name": "conv3_block9_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block10_0_bn/gamma", "shape": [544]}, {"dtype": "float32", "name": "conv4_block10_0_bn/beta", "shape": [544]}, {"dtype": "float32", "name": "conv4_block10_0_bn/moving_mean", "shape": [544]}, {"dtype": "float32", "name": "conv4_block10_0_bn/moving_variance", "shape": [544]}, {"dtype": "float32", "name": "conv4_block10_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block10_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block10_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block10_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block10_1_conv/kernel", "shape": [1, 1, 544, 128]}, {"dtype": "float32", "name": "conv4_block10_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block11_0_bn/gamma", "shape": [576]}, {"dtype": "float32", "name": "conv4_block11_0_bn/beta", "shape": [576]}, {"dtype": "float32", "name": "conv4_block11_0_bn/moving_mean", "shape": [576]}, {"dtype": "float32", "name": "conv4_block11_0_bn/moving_variance", "shape": [576]}, {"dtype": "float32", "name": "conv4_block11_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block11_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block11_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block11_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block11_1_conv/kernel", "shape": [1, 1, 576, 128]}, {"dtype": "float32", "name": "conv4_block11_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block12_0_bn/gamma", "shape": [608]}, {"dtype": "float32", "name": "conv4_block12_0_bn/beta", "shape": [608]}, {"dtype": "float32", "name": "conv4_block12_0_bn/moving_mean", "shape": [608]}, {"dtype": "float32", "name": "conv4_block12_0_bn/moving_variance", "shape": [608]}, {"dtype": "float32", "name": "conv4_block12_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block12_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block12_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block12_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block12_1_conv/kernel", "shape": [1, 1, 608, 128]}, {"dtype": "float32", "name": "conv4_block12_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block13_0_bn/gamma", "shape": [640]}, {"dtype": "float32", "name": "conv4_block13_0_bn/beta", "shape": [640]}, {"dtype": "float32", "name": "conv4_block13_0_bn/moving_mean", "shape": [640]}, {"dtype": "float32", "name": "conv4_block13_0_bn/moving_variance", "shape": [640]}, {"dtype": "float32", "name": "conv4_block13_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block13_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block13_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block13_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block13_1_conv/kernel", "shape": [1, 1, 640, 128]}, {"dtype": "float32", "name": "conv4_block13_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block14_0_bn/gamma", "shape": [672]}, {"dtype": "float32", "name": "conv4_block14_0_bn/beta", "shape": [672]}, {"dtype": "float32", "name": "conv4_block14_0_bn/moving_mean", "shape": [672]}, {"dtype": "float32", "name": "conv4_block14_0_bn/moving_variance", "shape": [672]}, {"dtype": "float32", "name": "conv4_block14_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block14_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block14_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block14_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block14_1_conv/kernel", "shape": [1, 1, 672, 128]}, {"dtype": "float32", "name": "conv4_block14_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block15_0_bn/gamma", "shape": [704]}, {"dtype": "float32", "name": "conv4_block15_0_bn/beta", "shape": [704]}, {"dtype": "float32", "name": "conv4_block15_0_bn/moving_mean", "shape": [704]}, {"dtype": "float32", "name": "conv4_block15_0_bn/moving_variance", "shape": [704]}, {"dtype": "float32", "name": "conv4_block15_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block15_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block15_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block15_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block15_1_conv/kernel", "shape": [1, 1, 704, 128]}, {"dtype": "float32", "name": "conv4_block15_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block16_0_bn/gamma", "shape": [736]}, {"dtype": "float32", "name": "conv4_block16_0_bn/beta", "shape": [736]}, {"dtype": "float32", "name": "conv4_block16_0_bn/moving_mean", "shape": [736]}, {"dtype": "float32", "name": "conv4_block16_0_bn/moving_variance", "shape": [736]}, {"dtype": "float32", "name": "conv4_block16_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block16_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block16_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block16_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block16_1_conv/kernel", "shape": [1, 1, 736, 128]}, {"dtype": "float32", "name": "conv4_block16_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block17_0_bn/gamma", "shape": [768]}, {"dtype": "float32", "name": "conv4_block17_0_bn/beta", "shape": [768]}, {"dtype": "float32", "name": "conv4_block17_0_bn/moving_mean", "shape": [768]}, {"dtype": "float32", "name": "conv4_block17_0_bn/moving_variance", "shape": [768]}, {"dtype": "float32", "name": "conv4_block17_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block17_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block17_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block17_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block17_1_conv/kernel", "shape": [1, 1, 768, 128]}, {"dtype": "float32", "name": "conv4_block17_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block18_0_bn/gamma", "shape": [800]}, {"dtype": "float32", "name": "conv4_block18_0_bn/beta", "shape": [800]}, {"dtype": "float32", "name": "conv4_block18_0_bn/moving_mean", "shape": [800]}, {"dtype": "float32", "name": "conv4_block18_0_bn/moving_variance", "shape": [800]}, {"dtype": "float32", "name": "conv4_block18_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block18_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block18_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block18_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block18_1_conv/kernel", "shape": [1, 1, 800, 128]}, {"dtype": "float32", "name": "conv4_block18_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block19_0_bn/gamma", "shape": [832]}, {"dtype": "float32", "name": "conv4_block19_0_bn/beta", "shape": [832]}, {"dtype": "float32", "name": "conv4_block19_0_bn/moving_mean", "shape": [832]}, {"dtype": "float32", "name": "conv4_block19_0_bn/moving_variance", "shape": [832]}, {"dtype": "float32", "name": "conv4_block19_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block19_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block19_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block19_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block19_1_conv/kernel", "shape": [1, 1, 832, 128]}, {"dtype": "float32", "name": "conv4_block19_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block1_0_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "conv4_block1_0_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "conv4_block1_0_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "conv4_block1_0_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv4_block1_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block1_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block1_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block1_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block1_1_conv/kernel", "shape": [1, 1, 256, 128]}, {"dtype": "float32", "name": "conv4_block1_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block20_0_bn/gamma", "shape": [864]}, {"dtype": "float32", "name": "conv4_block20_0_bn/beta", "shape": [864]}, {"dtype": "float32", "name": "conv4_block20_0_bn/moving_mean", "shape": [864]}, {"dtype": "float32", "name": "conv4_block20_0_bn/moving_variance", "shape": [864]}, {"dtype": "float32", "name": "conv4_block20_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block20_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block20_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block20_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block20_1_conv/kernel", "shape": [1, 1, 864, 128]}, {"dtype": "float32", "name": "conv4_block20_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block21_0_bn/gamma", "shape": [896]}, {"dtype": "float32", "name": "conv4_block21_0_bn/beta", "shape": [896]}, {"dtype": "float32", "name": "conv4_block21_0_bn/moving_mean", "shape": [896]}, {"dtype": "float32", "name": "conv4_block21_0_bn/moving_variance", "shape": [896]}, {"dtype": "float32", "name": "conv4_block21_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block21_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block21_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block21_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block21_1_conv/kernel", "shape": [1, 1, 896, 128]}, {"dtype": "float32", "name": "conv4_block21_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block22_0_bn/gamma", "shape": [928]}, {"dtype": "float32", "name": "conv4_block22_0_bn/beta", "shape": [928]}, {"dtype": "float32", "name": "conv4_block22_0_bn/moving_mean", "shape": [928]}, {"dtype": "float32", "name": "conv4_block22_0_bn/moving_variance", "shape": [928]}, {"dtype": "float32", "name": "conv4_block22_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block22_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block22_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block22_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block22_1_conv/kernel", "shape": [1, 1, 928, 128]}, {"dtype": "float32", "name": "conv4_block22_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block23_0_bn/gamma", "shape": [960]}, {"dtype": "float32", "name": "conv4_block23_0_bn/beta", "shape": [960]}, {"dtype": "float32", "name": "conv4_block23_0_bn/moving_mean", "shape": [960]}, {"dtype": "float32", "name": "conv4_block23_0_bn/moving_variance", "shape": [960]}, {"dtype": "float32", "name": "conv4_block23_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block23_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block23_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block23_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block23_1_conv/kernel", "shape": [1, 1, 960, 128]}, {"dtype": "float32", "name": "conv4_block23_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block24_0_bn/gamma", "shape": [992]}, {"dtype": "float32", "name": "conv4_block24_0_bn/beta", "shape": [992]}, {"dtype": "float32", "name": "conv4_block24_0_bn/moving_mean", "shape": [992]}, {"dtype": "float32", "name": "conv4_block24_0_bn/moving_variance", "shape": [992]}, {"dtype": "float32", "name": "conv4_block24_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block24_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block24_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block24_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block24_1_conv/kernel", "shape": [1, 1, 992, 128]}, {"dtype": "float32", "name": "conv4_block24_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block2_0_bn/gamma", "shape": [288]}, {"dtype": "float32", "name": "conv4_block2_0_bn/beta", "shape": [288]}, {"dtype": "float32", "name": "conv4_block2_0_bn/moving_mean", "shape": [288]}, {"dtype": "float32", "name": "conv4_block2_0_bn/moving_variance", "shape": [288]}, {"dtype": "float32", "name": "conv4_block2_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block2_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block2_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block2_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block2_1_conv/kernel", "shape": [1, 1, 288, 128]}, {"dtype": "float32", "name": "conv4_block2_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block3_0_bn/gamma", "shape": [320]}, {"dtype": "float32", "name": "conv4_block3_0_bn/beta", "shape": [320]}, {"dtype": "float32", "name": "conv4_block3_0_bn/moving_mean", "shape": [320]}, {"dtype": "float32", "name": "conv4_block3_0_bn/moving_variance", "shape": [320]}, {"dtype": "float32", "name": "conv4_block3_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block3_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block3_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block3_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block3_1_conv/kernel", "shape": [1, 1, 320, 128]}, {"dtype": "float32", "name": "conv4_block3_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block4_0_bn/gamma", "shape": [352]}, {"dtype": "float32", "name": "conv4_block4_0_bn/beta", "shape": [352]}, {"dtype": "float32", "name": "conv4_block4_0_bn/moving_mean", "shape": [352]}, {"dtype": "float32", "name": "conv4_block4_0_bn/moving_variance", "shape": [352]}, {"dtype": "float32", "name": "conv4_block4_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block4_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block4_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block4_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block4_1_conv/kernel", "shape": [1, 1, 352, 128]}, {"dtype": "float32", "name": "conv4_block4_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block5_0_bn/gamma", "shape": [384]}, {"dtype": "float32", "name": "conv4_block5_0_bn/beta", "shape": [384]}, {"dtype": "float32", "name": "conv4_block5_0_bn/moving_mean", "shape": [384]}, {"dtype": "float32", "name": "conv4_block5_0_bn/moving_variance", "shape": [384]}, {"dtype": "float32", "name": "conv4_block5_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block5_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block5_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block5_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block5_1_conv/kernel", "shape": [1, 1, 384, 128]}, {"dtype": "float32", "name": "conv4_block5_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block6_0_bn/gamma", "shape": [416]}, {"dtype": "float32", "name": "conv4_block6_0_bn/beta", "shape": [416]}, {"dtype": "float32", "name": "conv4_block6_0_bn/moving_mean", "shape": [416]}, {"dtype": "float32", "name": "conv4_block6_0_bn/moving_variance", "shape": [416]}, {"dtype": "float32", "name": "conv4_block6_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block6_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block6_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block6_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block6_1_conv/kernel", "shape": [1, 1, 416, 128]}, {"dtype": "float32", "name": "conv4_block6_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block7_0_bn/gamma", "shape": [448]}, {"dtype": "float32", "name": "conv4_block7_0_bn/beta", "shape": [448]}, {"dtype": "float32", "name": "conv4_block7_0_bn/moving_mean", "shape": [448]}, {"dtype": "float32", "name": "conv4_block7_0_bn/moving_variance", "shape": [448]}, {"dtype": "float32", "name": "conv4_block7_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block7_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block7_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block7_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block7_1_conv/kernel", "shape": [1, 1, 448, 128]}, {"dtype": "float32", "name": "conv4_block7_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block8_0_bn/gamma", "shape": [480]}, {"dtype": "float32", "name": "conv4_block8_0_bn/beta", "shape": [480]}, {"dtype": "float32", "name": "conv4_block8_0_bn/moving_mean", "shape": [480]}, {"dtype": "float32", "name": "conv4_block8_0_bn/moving_variance", "shape": [480]}, {"dtype": "float32", "name": "conv4_block8_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block8_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block8_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block8_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block8_1_conv/kernel", "shape": [1, 1, 480, 128]}, {"dtype": "float32", "name": "conv4_block8_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv4_block9_0_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv4_block9_0_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv4_block9_0_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv4_block9_0_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv4_block9_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv4_block9_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv4_block9_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv4_block9_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv4_block9_1_conv/kernel", "shape": [1, 1, 512, 128]}, {"dtype": "float32", "name": "conv4_block9_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block10_0_bn/gamma", "shape": [800]}, {"dtype": "float32", "name": "conv5_block10_0_bn/beta", "shape": [800]}, {"dtype": "float32", "name": "conv5_block10_0_bn/moving_mean", "shape": [800]}, {"dtype": "float32", "name": "conv5_block10_0_bn/moving_variance", "shape": [800]}, {"dtype": "float32", "name": "conv5_block10_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block10_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block10_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block10_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block10_1_conv/kernel", "shape": [1, 1, 800, 128]}, {"dtype": "float32", "name": "conv5_block10_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block11_0_bn/gamma", "shape": [832]}, {"dtype": "float32", "name": "conv5_block11_0_bn/beta", "shape": [832]}, {"dtype": "float32", "name": "conv5_block11_0_bn/moving_mean", "shape": [832]}, {"dtype": "float32", "name": "conv5_block11_0_bn/moving_variance", "shape": [832]}, {"dtype": "float32", "name": "conv5_block11_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block11_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block11_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block11_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block11_1_conv/kernel", "shape": [1, 1, 832, 128]}, {"dtype": "float32", "name": "conv5_block11_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block12_0_bn/gamma", "shape": [864]}, {"dtype": "float32", "name": "conv5_block12_0_bn/beta", "shape": [864]}, {"dtype": "float32", "name": "conv5_block12_0_bn/moving_mean", "shape": [864]}, {"dtype": "float32", "name": "conv5_block12_0_bn/moving_variance", "shape": [864]}, {"dtype": "float32", "name": "conv5_block12_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block12_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block12_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block12_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block12_1_conv/kernel", "shape": [1, 1, 864, 128]}, {"dtype": "float32", "name": "conv5_block12_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block13_0_bn/gamma", "shape": [896]}, {"dtype": "float32", "name": "conv5_block13_0_bn/beta", "shape": [896]}, {"dtype": "float32", "name": "conv5_block13_0_bn/moving_mean", "shape": [896]}, {"dtype": "float32", "name": "conv5_block13_0_bn/moving_variance", "shape": [896]}, {"dtype": "float32", "name": "conv5_block13_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block13_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block13_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block13_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block13_1_conv/kernel", "shape": [1, 1, 896, 128]}, {"dtype": "float32", "name": "conv5_block13_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block14_0_bn/gamma", "shape": [928]}, {"dtype": "float32", "name": "conv5_block14_0_bn/beta", "shape": [928]}, {"dtype": "float32", "name": "conv5_block14_0_bn/moving_mean", "shape": [928]}, {"dtype": "float32", "name": "conv5_block14_0_bn/moving_variance", "shape": [928]}, {"dtype": "float32", "name": "conv5_block14_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block14_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block14_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block14_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block14_1_conv/kernel", "shape": [1, 1, 928, 128]}, {"dtype": "float32", "name": "conv5_block14_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block15_0_bn/gamma", "shape": [960]}, {"dtype": "float32", "name": "conv5_block15_0_bn/beta", "shape": [960]}, {"dtype": "float32", "name": "conv5_block15_0_bn/moving_mean", "shape": [960]}, {"dtype": "float32", "name": "conv5_block15_0_bn/moving_variance", "shape": [960]}, {"dtype": "float32", "name": "conv5_block15_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block15_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block15_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block15_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block15_1_conv/kernel", "shape": [1, 1, 960, 128]}, {"dtype": "float32", "name": "conv5_block15_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block16_0_bn/gamma", "shape": [992]}, {"dtype": "float32", "name": "conv5_block16_0_bn/beta", "shape": [992]}, {"dtype": "float32", "name": "conv5_block16_0_bn/moving_mean", "shape": [992]}, {"dtype": "float32", "name": "conv5_block16_0_bn/moving_variance", "shape": [992]}, {"dtype": "float32", "name": "conv5_block16_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block16_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block16_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block16_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block16_1_conv/kernel", "shape": [1, 1, 992, 128]}, {"dtype": "float32", "name": "conv5_block16_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block1_0_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "conv5_block1_0_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "conv5_block1_0_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "conv5_block1_0_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "conv5_block1_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block1_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block1_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block1_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block1_1_conv/kernel", "shape": [1, 1, 512, 128]}, {"dtype": "float32", "name": "conv5_block1_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block2_0_bn/gamma", "shape": [544]}, {"dtype": "float32", "name": "conv5_block2_0_bn/beta", "shape": [544]}, {"dtype": "float32", "name": "conv5_block2_0_bn/moving_mean", "shape": [544]}, {"dtype": "float32", "name": "conv5_block2_0_bn/moving_variance", "shape": [544]}, {"dtype": "float32", "name": "conv5_block2_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block2_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block2_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block2_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block2_1_conv/kernel", "shape": [1, 1, 544, 128]}, {"dtype": "float32", "name": "conv5_block2_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block3_0_bn/gamma", "shape": [576]}, {"dtype": "float32", "name": "conv5_block3_0_bn/beta", "shape": [576]}, {"dtype": "float32", "name": "conv5_block3_0_bn/moving_mean", "shape": [576]}, {"dtype": "float32", "name": "conv5_block3_0_bn/moving_variance", "shape": [576]}, {"dtype": "float32", "name": "conv5_block3_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block3_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block3_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block3_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block3_1_conv/kernel", "shape": [1, 1, 576, 128]}, {"dtype": "float32", "name": "conv5_block3_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block4_0_bn/gamma", "shape": [608]}, {"dtype": "float32", "name": "conv5_block4_0_bn/beta", "shape": [608]}, {"dtype": "float32", "name": "conv5_block4_0_bn/moving_mean", "shape": [608]}, {"dtype": "float32", "name": "conv5_block4_0_bn/moving_variance", "shape": [608]}, {"dtype": "float32", "name": "conv5_block4_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block4_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block4_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block4_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block4_1_conv/kernel", "shape": [1, 1, 608, 128]}, {"dtype": "float32", "name": "conv5_block4_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block5_0_bn/gamma", "shape": [640]}, {"dtype": "float32", "name": "conv5_block5_0_bn/beta", "shape": [640]}, {"dtype": "float32", "name": "conv5_block5_0_bn/moving_mean", "shape": [640]}, {"dtype": "float32", "name": "conv5_block5_0_bn/moving_variance", "shape": [640]}, {"dtype": "float32", "name": "conv5_block5_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block5_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block5_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block5_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block5_1_conv/kernel", "shape": [1, 1, 640, 128]}, {"dtype": "float32", "name": "conv5_block5_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block6_0_bn/gamma", "shape": [672]}, {"dtype": "float32", "name": "conv5_block6_0_bn/beta", "shape": [672]}, {"dtype": "float32", "name": "conv5_block6_0_bn/moving_mean", "shape": [672]}, {"dtype": "float32", "name": "conv5_block6_0_bn/moving_variance", "shape": [672]}, {"dtype": "float32", "name": "conv5_block6_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block6_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block6_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block6_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block6_1_conv/kernel", "shape": [1, 1, 672, 128]}, {"dtype": "float32", "name": "conv5_block6_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block7_0_bn/gamma", "shape": [704]}, {"dtype": "float32", "name": "conv5_block7_0_bn/beta", "shape": [704]}, {"dtype": "float32", "name": "conv5_block7_0_bn/moving_mean", "shape": [704]}, {"dtype": "float32", "name": "conv5_block7_0_bn/moving_variance", "shape": [704]}, {"dtype": "float32", "name": "conv5_block7_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block7_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block7_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block7_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block7_1_conv/kernel", "shape": [1, 1, 704, 128]}, {"dtype": "float32", "name": "conv5_block7_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block8_0_bn/gamma", "shape": [736]}, {"dtype": "float32", "name": "conv5_block8_0_bn/beta", "shape": [736]}, {"dtype": "float32", "name": "conv5_block8_0_bn/moving_mean", "shape": [736]}, {"dtype": "float32", "name": "conv5_block8_0_bn/moving_variance", "shape": [736]}, {"dtype": "float32", "name": "conv5_block8_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block8_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block8_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block8_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block8_1_conv/kernel", "shape": [1, 1, 736, 128]}, {"dtype": "float32", "name": "conv5_block8_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "conv5_block9_0_bn/gamma", "shape": [768]}, {"dtype": "float32", "name": "conv5_block9_0_bn/beta", "shape": [768]}, {"dtype": "float32", "name": "conv5_block9_0_bn/moving_mean", "shape": [768]}, {"dtype": "float32", "name": "conv5_block9_0_bn/moving_variance", "shape": [768]}, {"dtype": "float32", "name": "conv5_block9_1_bn/gamma", "shape": [128]}, {"dtype": "float32", "name": "conv5_block9_1_bn/beta", "shape": [128]}, {"dtype": "float32", "name": "conv5_block9_1_bn/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "conv5_block9_1_bn/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "conv5_block9_1_conv/kernel", "shape": [1, 1, 768, 128]}, {"dtype": "float32", "name": "conv5_block9_2_conv/kernel", "shape": [3, 3, 128, 32]}, {"dtype": "float32", "name": "fc1000/kernel", "shape": [1024, 5]}, {"dtype": "float32", "name": "fc1000/bias", "shape": [5]}, {"dtype": "float32", "name": "pool2_bn/gamma", "shape": [256]}, {"dtype": "float32", "name": "pool2_bn/beta", "shape": [256]}, {"dtype": "float32", "name": "pool2_bn/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "pool2_bn/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "pool2_conv/kernel", "shape": [1, 1, 256, 128]}, {"dtype": "float32", "name": "pool3_bn/gamma", "shape": [512]}, {"dtype": "float32", "name": "pool3_bn/beta", "shape": [512]}, {"dtype": "float32", "name": "pool3_bn/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "pool3_bn/moving_variance", "shape": [512]}, {"dtype": "float32", "name": "pool3_conv/kernel", "shape": [1, 1, 512, 256]}, {"dtype": "float32", "name": "pool4_bn/gamma", "shape": [1024]}, {"dtype": "float32", "name": "pool4_bn/beta", "shape": [1024]}, {"dtype": "float32", "name": "pool4_bn/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "pool4_bn/moving_variance", "shape": [1024]}, {"dtype": "float32", "name": "pool4_conv/kernel", "shape": [1, 1, 1024, 512]}]}], "modelTopology": {"training_config": {"sample_weight_mode": null, "metrics": ["accuracy"], "loss_weights": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 1.0000000656873453e-05, "beta_1": 0.8999999761581421}}}, "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["fc1000", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 256, 256, 1], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "zero_padding2d", "config": {"padding": [[3, 3], [3, 3]], "dtype": "float32", "data_format": "channels_last", "name": "zero_padding2d", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv1/conv", "config": {"padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "strides": [2, 2], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "filters": 64, "dtype": "float32", "name": "conv1/conv", "use_bias": false, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [7, 7]}}, {"inbound_nodes": [[["conv1/conv", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv1/bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "gamma_regularizer": null, "axis": [3], "name": "conv1/bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", 